---
title: AnalysisDisplayColoredSurfaceSettings
classe: Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# AnalysisDisplayColoredSurfaceSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Color GridColor { get; set; }` | `analysisDisplayColoredSurfaceSettings.GridColor` | Color |
| `Int32 GridLineWeight { get; set; }` | `analysisDisplayColoredSurfaceSettings.GridLineWeight` | Int32 |
| `Boolean IsValidObject { get; }` | `analysisDisplayColoredSurfaceSettings.IsValidObject` | Boolean |
| `Boolean ShowContourLines { get; set; }` | `analysisDisplayColoredSurfaceSettings.ShowContourLines` | Boolean |
| `Boolean ShowGridLines { get; set; }` | `analysisDisplayColoredSurfaceSettings.ShowGridLines` | Boolean |
| `Int32 Transparency { get; set; }` | `analysisDisplayColoredSurfaceSettings.Transparency` | Int32 |
| `Void Dispose()` | `analysisDisplayColoredSurfaceSettings.Dispose()` | Void |
| `Boolean IsEqual(AnalysisDisplayColoredSurfaceSettings)` | `analysisDisplayColoredSurfaceSettings.IsEqual(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```